IDENTIFICATION DIVISION.
PROGRAM-ID. cajario_core.
DATA DIVISION.
LINKAGE SECTION.
01 LS-DATA.
   05 LS-TARJETA   PIC 9(18) COMP-5.
   05 LS-PIN       PIC 9(04) COMP-5.
   05 LS-MONTO     COMP-2.
   05 LS-STATUS    PIC X(02).
PROCEDURE DIVISION USING LS-DATA.
    MOVE "00" TO LS-STATUS.
    IF LS-PIN NOT = 1234
        MOVE "01" TO LS-STATUS
    END-IF.
    IF LS-MONTO > 10000.00 AND LS-STATUS = "00"
        MOVE "02" TO LS-STATUS
    END-IF.
    GOBACK.
    